# print('Hello world')
# //////////////////////////////////типы данных и переменная
# int,float,boolean,str,list,None
#  a = 155
#  b = 1.55
# valye = None #чтобы потом можно бы назчить, потом в коде
# print(a) # вывод данных
# print(b)
# print(type(a)) # посмотреть тип данных
# print(type(b))
# print(type(valye))
# str = "Hello world"
# a = 5
# b = 1.5
# print(a,b,str)# вывод строки
# str = "Hello world"
# a = 5
# b = 1.5
# print(a,'-',b,'-',str)# вставить 
# str = "Hello world"
# a = 5
# b = 1.5
# print(a,b,str)
# print('{}-{}-{}'.format(a,b,str))# что и вверху формат
# print('{2}-{1}-{0}'.format(a,b,str))# по индексу
# print(f'{a}-{b}-{str}') #инторполяция
# f =False # также и truth
# print(False)
# list=[]# это список, как в C# массивы, list не может быть переменной!
# print(list)
# list=['1','2','3'] # однотипные данные
# col= ['hello',1,2,3,1.5,True] # разные типы
# print(list)
# print(col)
# ////////////////////Ввод и вывод данных
# input and print
# print('Введите a')
# a = input()
# print('Введите b')
# b = input()
# print(a,b)
# print('{} {}'.format(a,b)) # что и 41 сторока
# print(f'{a} {b}') # что и 41 и 42 строки
#//////////////////////////
# print('Введите a')
# a = input()
# print('Введите b')
# b = input()
# print(a, '+', b,'=',a+b ) # будет сложение строк,не арихметическое действие
# print('Введите a')
# a =int(input())
# print('Введите b')
# b =int(input())
# print(a, '+', b,'=',a+b ) # чтобы математически перед input ставим
# int!!!! целые числа
#/////////////////////////////
# print('Введите a')
# a =float(input())
# print('Введите b')
# b =float(input())
# print(a, '+', b,'=',a+b ) # вещественные 1.5 и тд
# ///////////////////////////////////////
# арифмитичекие операции
# +,-,*,/,%,,//,** ()дает приоритет
# a = 125
# b = 325
# c = a+b
# print(c) # простое сложение
#/////////////////////
# a = +125 # унарный плюс, но он не ставиться
# b = -252 # унарный минус(инферсия числа)
# c = a+b
# print(c) 
#//////////////////////
# a = 10
# b = 3
# c = a/b
# print(c) # / операция деления как для вещественных чисел с остатком
#//////////////////////////////////
# a = 12
# b = 8
# c =12//8 # целое без остатка
# print(c)
#/////////////////////////////////
# a = 10
# b = 6
# c = a%b # остаток от деления
# print(c)
# ///////////////////////////////
# a = 2
# b = 8
# c = a**b # возведение в степень
# print(c)
# ///////////////////////////////
# a = 1.2
# b = 3
# c =a*b # 3.59999999999  выведет
# print(c)
# a = 1.2
# b = 3
# c = round (a*b) # округление и можно через , после b указать 
# # сколько цифр после показывать
# print(c)
# /////////////////////////
# сокращенные операции присваивания
# a = 3
# # a = a * 3
# a *= 3 # операция умножения
# print(a)
# /////////////////////////////
# Логические операции
# >,>=,<,<=,==,!=
# not,and, or - не путать с &,|,^
# is,is not,in,not in
# a = 1>4
# print(a) # не правда false
# a = 5>1 # можнобольше 2 в отличии от C#
# print(a) # true
#////////////////////////////////////
# f =[1,2,36,7]
# print(f)
# print(2 in f) # есть ли цифра 2 в списке, можно поствить not
# ////////////////////////////////
# a = [1,2,3,4]
# is_odd =  not a [0] % 2 # остаток от деления
# print(is_odd)
# //////////////////////////////////////
# a = int(input('введите число а :'))
# b = int(input('введите число b :'))
# if a>b:
#     print(a)
# else:
#     print(b)
# //////////////////////////////////////
# username = input('Введите имя : ')
# if username == 'Миша':
#     print('Ура! это же Миша')
# elif username == 'Матвей':   # еще выделить уловие через elif
#     print('Я вас ждала Матвей')
# elif username == 'Рома':
#     print('Рома, топ!')  
# else:
#     print('Привет,', username)       
# ///////////////////////////////////
# original = 62
# iverted = 0
# while original != 0: # не равен 0
#     iverted = iverted * 10 + (original % 10) # переворачиваем число
#     original //= 10
# print(iverted) 
# original = 62
# iverted = 0
# while original != 0: # не равен 0
#     iverted = iverted * 10 + (original % 10) # переворачиваем число
#     original //= 10
#     print(original)
# else : # когда условие перестает выполняться
#     print('пожалуй хватит')
#     print(iverted) 
# /////////////////////////
# for
# for i in 1,2,3,4,5: # обязательно в конце :
#     print(i**2) # возведение ва 2 степень
#/////////////////////////
# r = range(10) # диапозон
# for i in r:
#     print(i) # покажет от 0 до 9(последняя цифра не входит)
# ///////////////////////
# не обязательно обьявлять переменную = range
# for i in range(1,10,3): # 1 и 10 диапозон, 3 счетчик как увеличивать
#     print(i) # обязательно i чтобы по числам проскочил
# ///////////////////////
# # можно перебирать стоки
# for i in 'jkjfijglgj - j ': # можно стоку, но тогда в ковычках
#         print(i)
# ///////////////////////
# text = 'Сьешь ещё этих мягких француских булочек'
# print(len(text)) # сколько символов
# print('ещё'in text) # есть ли это в тексте true
# print(text.isdigit()) # есть ли числа
# print(text.islower()) # нижний регистр есть ли
# print(text.replace('ещё','ЕЩЁ')) # замена
# print(text[0]) # выдает первый символ по индексу
# print(text[1]) # 2 символ
# print(text[len(text)]) # IndexError
# print(text[len (text) - 1]) # последний символ
# print(text[-5]) # -5 индекс = л
# print(text[:]) # выводит текст
# # ///////////////////////
# # Финкции
def f (x):
    if x ==1:
        return 'целое'
    elif x ==2.3:
        return 23
    else:
        return
arg = 2.1
print(f(arg))   
print(type (f(arg)))     
