# 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.

# -------------------------------------- 1 вариант

# num = int(input("Введите число : "))
# result = 1

# for i in range(num):
#     print(result, end=", ")
#     result *= -3


# -------------------------------------- 2 вариант

# num = int(input())

# for i in range(num):
#     print((-3) ** i, end=", ")
# ////////////////////////// 3 пример
# def n_func():
#     for i in range(int(input("Input your number, please: "))):
#         print((-3) ** i, end = ' ')

# n_func()
 
 
# a = 15 // (16 % 7)
# b =  29 % 5 *2
# # b = 34 % a * 5 - 29 % 5 * 2
